{
  "phase": 4,
  "title": "Hero Offer Ideation",
  "intro": "Welcome to the **Hero Offer Ideation Workshop**. In this **15-minute sprint** you'll use ChatGPT (free) to turn a real market context into three sharply distinct product/service concepts, then see how an AI can score them against simple criteria and recommend a direction. You don't need to read the market report yourself—you'll upload it to ChatGPT so the model can ground its thinking while you focus on clear inputs and good decisions.\n\n**The scenario you're working in: STEM Toys for Ages 4–8**\n\nYou're stepping into the roles of a brand-new STEM toy company's core team (product, design, operations, and marketing hats). Your job is to use ChatGPT to turn real market context into three distinct \"hero offer\" concepts—flagship ideas that could define the brand—then see how AI scores and recommends a direction using simple decision criteria.",
  "estimatedTime": "15 minutes",
  "fields": [
    {
      "id": "company_name",
      "label": "STEM Toy Company Name",
      "type": "text",
      "placeholder": "e.g., Kidwins",
      "required": true,
      "persist": true,
      "help": "Your STEM toy company name for this exercise",
      "tooltip": "Choose a name for your new STEM toy company. This will be used throughout the AI analysis. You can use 'Kidwins' from the market report or create your own."
    },
    {
      "id": "unmet_needs",
      "label": "Chosen Unmet Need from STEM Toy Market",
      "type": "textarea",
      "placeholder": "e.g., Parents want hands-on, screen-light play that clearly builds early math and science skills but are skeptical of vague 'STEM' claims and need plain-language learning outcomes they can trust.",
      "required": true,
      "persist": true,
      "help": "Choose one specific unmet need from the STEM toy market brief to focus your concepts on.",
      "tooltip": "Select one key customer problem from the STEM toy market context: authentic learning with clear outcomes, low-fuss setup with parent confidence, or durable/reusable kits with level-up progression. This will focus your product concepts."
    },
    {
      "id": "feasibility_weight",
      "label": "Feasibility Weight (%)",
      "type": "text",
      "placeholder": "e.g., 40",
      "required": true,
      "persist": true,
      "help": "How easy/complex will it be to develop and launch? (must total 100% with other weights)",
      "tooltip": "Higher weights favor simpler STEM toy concepts you can launch quickly. Consider manufacturing complexity, safety testing requirements, and supply chain for physical toys."
    },
    {
      "id": "differentiation_weight",
      "label": "Differentiation Weight (%)",
      "type": "text",
      "placeholder": "e.g., 35",
      "required": true,
      "persist": true,
      "help": "How unique compared to existing STEM toy offerings?",
      "tooltip": "Values uniqueness in the competitive STEM toy landscape. The market analysis shows many similar building sets and kits, so differentiation through unique learning approaches or parent experience could be crucial."
    },
    {
      "id": "margin_weight",
      "label": "Margin Potential Weight (%)",
      "type": "text",
      "placeholder": "e.g., 25",
      "required": true,
      "persist": true,
      "help": "How strong is the profit potential for this STEM toy? (total must equal 100%)",
      "tooltip": "Evaluates revenue potential and pricing power in the STEM toy market. Consider manufacturing costs, retail margins, and parent willingness to pay premium for educational value."
    },
    {
      "id": "brand_adj_1",
      "label": "Brand Adjective 1",
      "type": "text",
      "placeholder": "e.g., Curious",
      "required": true,
      "persist": true,
      "help": "First adjective to guide concept tone and feel",
      "tooltip": "Influences how AI designs product concepts. 'Curious' leads to exploration-focused features, 'Trustworthy' emphasizes security and reliability. Choose words that reflect your target customer values."
    },
    {
      "id": "brand_adj_2",
      "label": "Brand Adjective 2",
      "type": "text",
      "placeholder": "e.g., Trustworthy",
      "required": true,
      "persist": true,
      "help": "Second adjective to guide concept tone and feel",
      "tooltip": "Adds depth to your brand personality. Combining 'Trustworthy' with 'Playful' creates different concepts than 'Trustworthy' with 'Premium'. These guide feature prioritization and user experience design."
    },
    {
      "id": "brand_adj_3",
      "label": "Brand Adjective 3",
      "type": "text",
      "placeholder": "e.g., Playful",
      "required": true,
      "persist": true,
      "help": "Third adjective to guide concept tone and feel",
      "tooltip": "Completes your brand personality trinity. These three adjectives work together to ensure AI-generated concepts feel authentically aligned with your intended brand experience and customer expectations."
    }
  ],
  "promptTemplate": "**ROLE**\nYou are the lead product strategist for {{company_name}}, a new STEM toy company targeting children ages 4-8.\n\n**CONTEXT**\nAnalyze the uploaded U.S. STEM Toys Market Analysis to understand the competitive landscape, market trends, and opportunities. Use this market intelligence to inform your concept development.\n\n**TARGET UNMET NEED**\n{{unmet_needs}}\n\n**SCORING WEIGHTS**\nFeasibility {{feasibility_weight}}%, Differentiation {{differentiation_weight}}%, Margin Potential {{margin_weight}}% (total 100%).\n\n**STEM TOY CONSTRAINTS**\n* Safety requirements for ages 4-8 (no small parts, non-toxic materials)\n* Educational value must be clearly communicated to parents\n* Setup time under 5 minutes for parent confidence\n* Align with brand personality: **{{brand_adj_1}}, {{brand_adj_2}}, {{brand_adj_3}}**\n* Competitive with existing STEM toy pricing expectations\n\n---\n\n**TASK**\n\n1.  **Market-Informed Need Analysis**\n    * Using the uploaded market analysis, explain how the target unmet need represents a strategic opportunity for {{company_name}} in the STEM toy space. Reference specific market insights in ≤ 75 words.\n\n2.  **Generate Three STEM Toy Concepts**\n    * Create three distinct STEM toy concepts for ages 4-8. For each concept, provide:\n        * Code-name (≤ 4 words, all caps)\n        * One-sentence value prop (focus on learning outcome)\n        * Key Features (≤ 25 words, emphasize educational benefits)\n        * Primary materials (child-safe, age-appropriate)\n        * Estimated manufacturing cost (USD, realistic for toy industry)\n        * Competitive advantage vs. existing STEM toys (≤ 15 words)\n\n3.  **STEM Toy Scoring Rubrics**\n    * Define 1-5 scoring rubrics specific to STEM toys:\n        * Feasibility: Manufacturing complexity, safety compliance, supply chain\n        * Differentiation: Unique learning approach, parent appeal, market gaps\n        * Margin Potential: Educational premium, cost structure, pricing power\n\n4.  **Score & Compare** \n    * Score each concept using the rubrics and apply the scoring weights\n    * Present: a) Summary Rankings with educational rationale b) Detailed scoring matrix\n\n5.  **Strategic Recommendation** \n    * Recommend the best STEM toy concept based on scoring and market fit\n    * Justify choice in ≤ 60 words focusing on educational impact and market opportunity\n    * Provide three hashtags suitable for STEM toy marketing\n\n---\n\n## OUTPUT FORMAT\n1️⃣ Need Analysis section → 2️⃣ Table of three concepts → 3️⃣ Scoring Rubrics section → 4️⃣ **Rankings & Scoring** → 5️⃣ Recommendation",
  "decisionBoxContent": {
    "title": "STEM Toy Market Context & Decisions",
    "subtitle": "Understanding the market and making strategic choices for your STEM toy concepts",
    "sections": [
      {
        "number": "1",
        "title": "Market Context: STEM Toys for Ages 4-8",
        "items": [
          {
            "label": "Your Operating Context",
            "content": "You're designing for families with children ages 4–8 in the U.S. STEM toys space. Think building sets, simple robotics, math & science kits, cause-and-effect toys, and playful learning accessories."
          },
          {
            "label": "Download & Upload the Market Analysis",
            "content": "**IMPORTANT**: Download the U.S. STEM Toys Market Analysis PDF from this page. You'll upload it to ChatGPT so the AI can ground its suggestions in real market data. You don't need to read the report yourself—the AI will analyze it."
          },
          {
            "label": "Market Unmet-Needs Brief",
            "content": "Parents of 4–8-year-olds want hands-on, screen-light play that clearly builds early math and science skills—they're skeptical of vague \"STEM\" claims and look for plain-language learning outcomes they can trust. A big barrier is adult friction: many kits are fussy to set up, messy, or assume the grown-up is a science teacher; families signal strong demand for start-in-under-5-minutes, repeatable activities, and step-by-step prompts that make non-expert adults feel confident."
          },
          {
            "label": "Choose Your Focus",
            "content": "From the brief above, choose one unmet need to target:\n\n• **Authentic learning with clear outcomes** (skeptical of vague claims)\n• **Low-fuss setup with parent confidence** (under 5 minutes, non-expert friendly)\n• **Durable/reusable kits with level-up progression** (repeatable, advancing difficulty)\n\nPaste your choice into the form field as your target unmet need."
          }
        ]
      },
      {
        "number": "2",
        "title": "Set Your STEM Toy Concept Scoring Weights",
        "items": [
          {
            "label": "Your Goal",
            "content": "Decide how the AI should prioritize three critical factors when evaluating STEM toy concepts:\n\n• **Feasibility**: How easy will it be to develop and launch? *(Manufacturing complexity, safety testing, supply chain)*\n• **Differentiation**: How unique compared to existing STEM toys? *(Novel learning approach, parent experience, competitive advantage)*\n• **Margin Potential**: How profitable could this STEM toy be? *(Premium educational value, manufacturing costs, retail pricing)*"
          },
          {
            "label": "STEM Toy Context",
            "content": "The market analysis shows crowded competition in basic building sets. Success often comes from clear educational outcomes, parent confidence, and differentiated learning approaches."
          },
          {
            "label": "Action",
            "content": "Assign percentage weights (must total 100%) based on your strategic priorities for this new STEM toy company."
          }
        ]
      },
      {
        "number": "3",
        "title": "Choose Brand Adjectives for Your STEM Toy Company",
        "items": [
          {
            "label": "STEM Toy Brand Examples",
            "content": "• Curious, Educational, Safe\n• Innovative, Trustworthy, Fun\n• Simple, Engaging, Reliable\n• Creative, Supportive, Quality"
          },
          {
            "label": "Action",
            "content": "Choose three adjectives that capture how you want parents and children to perceive your STEM toy brand."
          }
        ]
      }
    ],
    "action": {
      "title": "Complete Setup",
      "items": [
        "Download the U.S. STEM Toys Market Analysis PDF from this page",
        "Choose your target unmet need from the market brief above",
        "Set your scoring weight percentages (must total 100%)",
        "Choose three brand adjectives for your STEM toy company",
        "Fill in all form fields before proceeding to ChatGPT"
      ]
    }
  },
  "stepByStepFlow": [
    {
      "step": 1,
      "action": "**Download the Market PDF**: **Download** the U.S. STEM Toys Market Analysis PDF from this page to your computer for upload to ChatGPT.",
      "time": "30 seconds"
    },
    {
      "step": 2,
      "action": "**Setup ChatGPT**: **Open** ChatGPT (free version works fine). **Upload** the U.S. STEM Toys Market Analysis PDF so the AI can analyze real market data.",
      "time": "1 minute"
    },
    {
      "step": 3,
      "action": "**Submit STEM Toy Prompt**: **Copy** the STEM Toy Ideation Prompt from the preview below, verify your company details and parameters are filled in, and **send** it to ChatGPT.",
      "time": "1 minute"
    },
    {
      "step": 4,
      "action": "**AI Analysis & Review**: ChatGPT will analyze the market data and generate three STEM toy concepts with scoring. **Review** the concepts for clarity and strategic fit with your chosen unmet need.",
      "time": "10+ minutes"
    }
  ],
  "expectedOutput": {
    "fileCreated": "Three STEM toy concepts with market-informed scoring and strategic recommendation",
    "whyItMatters": "This exercise demonstrates how AI can rapidly transform market research into actionable product concepts. You'll see how AI processes real market data, applies strategic criteria, and provides data-driven recommendations—a powerful approach for ideation and strategic planning.",
    "nextSteps": "Compare the AI's analysis with your own instincts. Notice how market data influenced the concepts and scoring. This methodology can be applied to any ideation challenge where you need to balance multiple strategic factors and generate evidence-based recommendations."
  }
}